# ============================================================
# My Brewfile
#
# Cài toàn bộ:
#   brew bundle --file=./Brewfile
#
# Kiểm tra:
#   brew bundle check --file=./Brewfile
# ============================================================


# ------------------------------------------------------------
# COMMAND-LINE TOOLS
# ------------------------------------------------------------

# Git - công cụ quản lý phiên bản mã nguồn.
brew "git"

# mise - quản lý phiên bản runtime và SDK.
brew "mise"


# ------------------------------------------------------------
# CODE EDITORS / IDE
# ------------------------------------------------------------

# Visual Studio Code - trình soạn thảo mã nguồn chính.
cask "visual-studio-code"

# Kiro - IDE tích hợp AI, phát triển dựa trên Code OSS.
cask "kiro"


# ------------------------------------------------------------
# VISUAL STUDIO CODE EXTENSIONS
# ------------------------------------------------------------

# Claude Code - tích hợp Claude Code vào VS Code.
vscode "anthropic.claude-code"

# Vellum Theme - giao diện màu cho VS Code.
vscode "msm0748.vellum-theme"

# Markdown PDF - xuất Markdown sang PDF, HTML, PNG hoặc JPEG.
vscode "yzane.markdown-pdf"

# WebStorm New Dark - theme mô phỏng giao diện WebStorm.
vscode "eenaree.webstorm-new-dark"

# Playwright Test - chạy và debug Playwright Test trong VS Code.
vscode "ms-playwright.playwright"

# Oracle SQL Developer Extension for VS Code.
vscode "oracle.sql-developer"


# ------------------------------------------------------------
# GIT GUI
# ------------------------------------------------------------

# SourceTree - quản lý Git bằng giao diện.
cask "sourcetree"


# ------------------------------------------------------------
# WEB BROWSERS
# ------------------------------------------------------------

# Google Chrome - trình duyệt chính để phát triển và kiểm thử web.
cask "google-chrome"

# Firefox - kiểm thử tương thích đa trình duyệt.
cask "firefox"


# ------------------------------------------------------------
# AI TOOLS
# ------------------------------------------------------------

# Claude Desktop - ứng dụng Claude trên macOS.
cask "claude"


# ------------------------------------------------------------
# CONTAINER / DEVOPS
# ------------------------------------------------------------

# Docker Desktop - Docker Engine, Docker Compose và container.
cask "docker-desktop"


# ------------------------------------------------------------
# COMMUNICATION
# ------------------------------------------------------------

# Microsoft Teams - họp và trao đổi công việc.
cask "microsoft-teams"


# ------------------------------------------------------------
# API DEVELOPMENT / TESTING
# ------------------------------------------------------------

# Postman - phát triển và kiểm thử REST/SOAP API.
cask "postman"


# ------------------------------------------------------------
# E-BOOK / READING
# ------------------------------------------------------------

# Calibre - quản lý, chuyển đổi và đọc sách điện tử.
cask "calibre"


# ------------------------------------------------------------
# ANDROID UTILITIES
# ------------------------------------------------------------

# Android File Transfer - truyền file giữa Android và macOS.
cask "android-file-transfer"

# Android Studio - IDE, Device Manager và Android Emulator.
cask "android-studio"
